OpenPuya/PY32M010_Firmware/Drivers/CMSIS/Device/PY32Mxxx/Include/py32m010x5.h
/********************  Bit definition for I2C_DR register  ********************/
#define I2C_DR_DR_Pos                   (0U)
#define I2C_DR_DR_Msk                   (0xFFUL << I2C_DR_DR_Pos)          /*!< 0x000000FF */
#define I2C_DR_DR                       I2C_DR_DR_Msk                      /*!< 8-bit Data Register */
#define I2C_DR_DR_0                     (0x01UL << I2C_DR_DR_Pos)
#define I2C_DR_DR_1                     (0x02UL << I2C_DR_DR_Pos)
#define I2C_DR_DR_2                     (0x04UL << I2C_DR_DR_Pos)
#define I2C_DR_DR_3                     (0x08UL << I2C_DR_DR_Pos)
#define I2C_DR_DR_4                     (0x10UL << I2C_DR_DR_Pos)
#define I2C_DR_DR_5                     (0x20UL << I2C_DR_DR_Pos)
#define I2C_DR_DR_6                     (0x40UL << I2C_DR_DR_Pos)
#define I2C_DR_DR_7                     (0x80UL << I2C_DR_DR_Pos)

/*******************  Bit definition for I2C_SR1 register  ********************/
#define I2C_SR1_SB_Pos                  (0U)
#define I2C_SR1_SB_Msk                  (0x1UL << I2C_SR1_SB_Pos)          /*!< 0x00000001 */
#define I2C_SR1_SB                      I2C_SR1_SB_Msk                     /*!< Start Bit (Master mode) */
#define I2C_SR1_ADDR_Pos                (1U)
#define I2C_SR1_ADDR_Msk                (0x1UL << I2C_SR1_ADDR_Pos)        /*!< 0x00000002 */
#define I2C_SR1_ADDR                    I2C_SR1_ADDR_Msk                   /*!< Address sent (master mode)/matched (slave mode) */
#define I2C_SR1_BTF_Pos                 (2U)
#define I2C_SR1_BTF_Msk                 (0x1UL << I2C_SR1_BTF_Pos)         /*!< 0x00000004 */
#define I2C_SR1_BTF                     I2C_SR1_BTF_Msk                    /*!< Byte Transfer Finished */
#define I2C_SR1_STOPF_Pos               (4U)
#define I2C_SR1_STOPF_Msk               (0x1UL << I2C_SR1_STOPF_Pos)       /*!< 0x00000010 */
#define I2C_SR1_STOPF                   I2C_SR1_STOPF_Msk                  /*!< Stop detection (Slave mode) */
#define I2C_SR1_RXNE_Pos                (6U)
#define I2C_SR1_RXNE_Msk                (0x1UL << I2C_SR1_RXNE_Pos)        /*!< 0x00000040 */
#define I2C_SR1_RXNE                    I2C_SR1_RXNE_Msk                   /*!< Data Register not Empty (receivers) */
#define I2C_SR1_TXE_Pos                 (7U)
#define I2C_SR1_TXE_Msk                 (0x1UL << I2C_SR1_TXE_Pos)         /*!< 0x00000080 */
#define I2C_SR1_TXE                     I2C_SR1_TXE_Msk                    /*!< Data Register Empty (transmitters) */
#define I2C_SR1_BERR_Pos                (8U)
#define I2C_SR1_BERR_Msk                (0x1UL << I2C_SR1_BERR_Pos)        /*!< 0x00000100 */
#define I2C_SR1_BERR                    I2C_SR1_BERR_Msk                   /*!< Bus Error */
#define I2C_SR1_ARLO_Pos                (9U)
#define I2C_SR1_ARLO_Msk                (0x1UL << I2C_SR1_ARLO_Pos)        /*!< 0x00000200 */
#define I2C_SR1_ARLO                    I2C_SR1_ARLO_Msk                   /*!< Arbitration Lost (master mode) */
#define I2C_SR1_AF_Pos                  (10U)
#define I2C_SR1_AF_Msk                  (0x1UL << I2C_SR1_AF_Pos)          /*!< 0x00000400 */
#define I2C_SR1_AF                      I2C_SR1_AF_Msk                     /*!< Acknowledge Failure */
#define I2C_SR1_OVR_Pos                 (11U)
#define I2C_SR1_OVR_Msk                 (0x1UL << I2C_SR1_OVR_Pos)         /*!< 0x00000800 */
#define I2C_SR1_OVR                     I2C_SR1_OVR_Msk                    /*!< Overrun/Underrun */

/*******************  Bit definition for I2C_SR2 register  ********************/
#define I2C_SR2_MSL_Pos                 (0U)
#define I2C_SR2_MSL_Msk                 (0x1UL << I2C_SR2_MSL_Pos)         /*!< 0x00000001 */
#define I2C_SR2_MSL                     I2C_SR2_MSL_Msk                    /*!< Master/Slave */
#define I2C_SR2_BUSY_Pos                (1U)
#define I2C_SR2_BUSY_Msk                (0x1UL << I2C_SR2_BUSY_Pos)        /*!< 0x00000002 */
#define I2C_SR2_BUSY                    I2C_SR2_BUSY_Msk                   /*!< Bus Busy */
#define I2C_SR2_TRA_Pos                 (2U)
#define I2C_SR2_TRA_Msk                 (0x1UL << I2C_SR2_TRA_Pos)         /*!< 0x00000004 */
#define I2C_SR2_TRA                     I2C_SR2_TRA_Msk                    /*!< Transmitter/Receiver */
#define I2C_SR2_GENCALL_Pos             (4U)
#define I2C_SR2_GENCALL_Msk             (0x1UL << I2C_SR2_GENCALL_Pos)     /*!< 0x00000010 */
#define I2C_SR2_GENCALL                 I2C_SR2_GENCALL_Msk                /*!< General Call Address (Slave mode) */

/*******************  Bit definition for I2C_CCR register  ********************/
#define I2C_CCR_CCR_Pos                 (0U)
#define I2C_CCR_CCR_Msk                 (0xFFFUL << I2C_CCR_CCR_Pos)       /*!< 0x00000FFF */
#define I2C_CCR_CCR                     I2C_CCR_CCR_Msk                    /*!< Clock Control Register in Fast/Standard mode (Master mode) */
#define I2C_CCR_DUTY_Pos                (14U)
#define I2C_CCR_DUTY_Msk                (0x1UL << I2C_CCR_DUTY_Pos)        /*!< 0x00004000 */
#define I2C_CCR_DUTY                    I2C_CCR_DUTY_Msk                   /*!< Fast Mode Duty Cycle */
#define I2C_CCR_FS_Pos                  (15U)
#define I2C_CCR_FS_Msk                  (0x1UL << I2C_CCR_FS_Pos)          /*!< 0x00008000 */
#define I2C_CCR_FS                      I2C_CCR_FS_Msk                     /*!< I2C Master Mode Selection */

/******************  Bit definition for I2C_TRISE register  *******************/
#define I2C_TRISE_TRISE_Pos             (0U)
#define I2C_TRISE_TRISE_Msk             (0x3FUL << I2C_TRISE_TRISE_Pos)    /*!< 0x0000003F */
#define I2C_TRISE_TRISE                 I2C_TRISE_TRISE_Msk                /*!< Maximum Rise Time in Fast/Standard mode (Master mode) */

/******************************************************************************/
/*                                                                            */
/*                        Independent WATCHDOG (IWDG)                         */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for IWDG_KR register  ********************/
#define IWDG_KR_KEY_Pos                 (0U)
#define IWDG_KR_KEY_Msk                 (0xFFFFUL << IWDG_KR_KEY_Pos)      /*!< 0x0000FFFF */
#define IWDG_KR_KEY                     IWDG_KR_KEY_Msk                    /*!<Key value (write only, read 0000h)  */

