OpenPuya/PY32M010_Firmware/Drivers/CMSIS/Device/PY32Mxxx/Include/py32m010x5.h
/********************  Bit definition for RCC_IOPRSTR register  ****************/
#define RCC_IOPRSTR_GPIOARST_Pos        (0U)
#define RCC_IOPRSTR_GPIOARST_Msk        (0x1UL << RCC_IOPRSTR_GPIOARST_Pos)    /*!< 0x00000001 */
#define RCC_IOPRSTR_GPIOARST            RCC_IOPRSTR_GPIOARST_Msk
#define RCC_IOPRSTR_GPIOBRST_Pos        (1U)
#define RCC_IOPRSTR_GPIOBRST_Msk        (0x1UL << RCC_IOPRSTR_GPIOBRST_Pos)    /*!< 0x00000002 */
#define RCC_IOPRSTR_GPIOBRST            RCC_IOPRSTR_GPIOBRST_Msk
#define RCC_IOPRSTR_GPIOCRST_Pos        (2U)
#define RCC_IOPRSTR_GPIOCRST_Msk        (0x1UL << RCC_IOPRSTR_GPIOCRST_Pos)    /*!< 0x00000004 */
#define RCC_IOPRSTR_GPIOCRST            RCC_IOPRSTR_GPIOCRST_Msk

/********************  Bit definition for RCC_AHBRSTR register  ***************/
#define RCC_AHBRSTR_FLASHRST_Pos        (8U)
#define RCC_AHBRSTR_FLASHRST_Msk        (0x1UL << RCC_AHBRSTR_FLASHRST_Pos)    /*!< 0x00000100 */
#define RCC_AHBRSTR_FLASHRST            RCC_AHBRSTR_FLASHRST_Msk
#define RCC_AHBRSTR_CRCRST_Pos          (12U)
#define RCC_AHBRSTR_CRCRST_Msk          (0x1UL << RCC_AHBRSTR_CRCRST_Pos)      /*!< 0x00001000 */
#define RCC_AHBRSTR_CRCRST              RCC_AHBRSTR_CRCRST_Msk

/********************  Bit definition for RCC_APBRSTR1 register  **************/
#define RCC_APBRSTR1_I2CRST_Pos         (21U)
#define RCC_APBRSTR1_I2CRST_Msk         (0x1UL << RCC_APBRSTR1_I2CRST_Pos)     /*!< 0x00200000 */
#define RCC_APBRSTR1_I2CRST             RCC_APBRSTR1_I2CRST_Msk
#define RCC_APBRSTR1_DBGRST_Pos         (27U)
#define RCC_APBRSTR1_DBGRST_Msk         (0x1UL << RCC_APBRSTR1_DBGRST_Pos)     /*!< 0x08000000 */
#define RCC_APBRSTR1_DBGRST             RCC_APBRSTR1_DBGRST_Msk
#define RCC_APBRSTR1_PWRRST_Pos         (28U)
#define RCC_APBRSTR1_PWRRST_Msk         (0x1UL << RCC_APBRSTR1_PWRRST_Pos)     /*!< 0x10000000 */
#define RCC_APBRSTR1_PWRRST             RCC_APBRSTR1_PWRRST_Msk
#define RCC_APBRSTR1_LPTIMRST_Pos       (31U)
#define RCC_APBRSTR1_LPTIMRST_Msk       (0x1UL << RCC_APBRSTR1_LPTIMRST_Pos)   /*!< 0x80000000 */
#define RCC_APBRSTR1_LPTIMRST           RCC_APBRSTR1_LPTIMRST_Msk

/********************  Bit definition for RCC_APBRSTR2 register  **************/
#define RCC_APBRSTR2_SYSCFGRST_Pos      (0U)
#define RCC_APBRSTR2_SYSCFGRST_Msk      (0x1UL << RCC_APBRSTR2_SYSCFGRST_Pos)  /*!< 0x00000001 */
#define RCC_APBRSTR2_SYSCFGRST          RCC_APBRSTR2_SYSCFGRST_Msk
#define RCC_APBRSTR2_TIM1RST_Pos        (11U)
#define RCC_APBRSTR2_TIM1RST_Msk        (0x1UL << RCC_APBRSTR2_TIM1RST_Pos)    /*!< 0x00000800 */
#define RCC_APBRSTR2_TIM1RST            RCC_APBRSTR2_TIM1RST_Msk
#define RCC_APBRSTR2_SPI1RST_Pos        (12U)
#define RCC_APBRSTR2_SPI1RST_Msk        (0x1UL << RCC_APBRSTR2_SPI1RST_Pos)    /*!< 0x00001000 */
#define RCC_APBRSTR2_SPI1RST            RCC_APBRSTR2_SPI1RST_Msk
#define RCC_APBRSTR2_USART1RST_Pos      (14U)
#define RCC_APBRSTR2_USART1RST_Msk      (0x1UL << RCC_APBRSTR2_USART1RST_Pos)  /*!< 0x00004000 */
#define RCC_APBRSTR2_USART1RST          RCC_APBRSTR2_USART1RST_Msk
#define RCC_APBRSTR2_TIM14RST_Pos       (15U)
#define RCC_APBRSTR2_TIM14RST_Msk       (0x1UL << RCC_APBRSTR2_TIM14RST_Pos)   /*!< 0x00008000 */
#define RCC_APBRSTR2_TIM14RST           RCC_APBRSTR2_TIM14RST_Msk
#define RCC_APBRSTR2_ADCRST_Pos         (20U)
#define RCC_APBRSTR2_ADCRST_Msk         (0x1UL << RCC_APBRSTR2_ADCRST_Pos)     /*!< 0x00100000 */
#define RCC_APBRSTR2_ADCRST             RCC_APBRSTR2_ADCRST_Msk
#define RCC_APBRSTR2_COMP1RST_Pos       (21U)
#define RCC_APBRSTR2_COMP1RST_Msk       (0x1UL << RCC_APBRSTR2_COMP1RST_Pos)   /*!< 0x00200000 */
#define RCC_APBRSTR2_COMP1RST           RCC_APBRSTR2_COMP1RST_Msk
#define RCC_APBRSTR2_COMP2RST_Pos       (22U)
#define RCC_APBRSTR2_COMP2RST_Msk       (0x1UL << RCC_APBRSTR2_COMP2RST_Pos)   /*!< 0x00400000 */
#define RCC_APBRSTR2_COMP2RST           RCC_APBRSTR2_COMP2RST_Msk

/********************  Bit definition for RCC_IOPENR register  ****************/
#define RCC_IOPENR_GPIOAEN_Pos          (0U)
#define RCC_IOPENR_GPIOAEN_Msk          (0x1UL << RCC_IOPENR_GPIOAEN_Pos)      /*!< 0x00000001 */
#define RCC_IOPENR_GPIOAEN              RCC_IOPENR_GPIOAEN_Msk
#define RCC_IOPENR_GPIOBEN_Pos          (1U)
#define RCC_IOPENR_GPIOBEN_Msk          (0x1UL << RCC_IOPENR_GPIOBEN_Pos)      /*!< 0x00000002 */
#define RCC_IOPENR_GPIOBEN              RCC_IOPENR_GPIOBEN_Msk
#define RCC_IOPENR_GPIOCEN_Pos          (2U)
#define RCC_IOPENR_GPIOCEN_Msk          (0x1UL << RCC_IOPENR_GPIOCEN_Pos)      /*!< 0x00000004 */
#define RCC_IOPENR_GPIOCEN              RCC_IOPENR_GPIOCEN_Msk

/********************  Bit definition for RCC_AHBENR register  ****************/
#define RCC_AHBENR_FLASHEN_Pos          (8U)
#define RCC_AHBENR_FLASHEN_Msk          (0x1UL << RCC_AHBENR_FLASHEN_Pos)      /*!< 0x00000100 */
#define RCC_AHBENR_FLASHEN              RCC_AHBENR_FLASHEN_Msk
#define RCC_AHBENR_SRAMEN_Pos           (9U)
#define RCC_AHBENR_SRAMEN_Msk           (0x1UL << RCC_AHBENR_SRAMEN_Pos)       /*!< 0x00000100 */
#define RCC_AHBENR_SRAMEN               RCC_AHBENR_SRAMEN_Msk
#define RCC_AHBENR_CRCEN_Pos            (12U)
#define RCC_AHBENR_CRCEN_Msk            (0x1UL << RCC_AHBENR_CRCEN_Pos)        /*!< 0x00001000 */
#define RCC_AHBENR_CRCEN                RCC_AHBENR_CRCEN_Msk

/********************  Bit definition for RCC_APBENR1 register  ***************/
#define RCC_APBENR1_I2CEN_Pos           (21U)
#define RCC_APBENR1_I2CEN_Msk           (0x1UL << RCC_APBENR1_I2CEN_Pos)       /*!< 0x00200000 */
#define RCC_APBENR1_I2CEN               RCC_APBENR1_I2CEN_Msk
#define RCC_APBENR1_DBGEN_Pos           (27U)
#define RCC_APBENR1_DBGEN_Msk           (0x1UL << RCC_APBENR1_DBGEN_Pos)       /*!< 0x08000000 */
#define RCC_APBENR1_DBGEN               RCC_APBENR1_DBGEN_Msk
#define RCC_APBENR1_PWREN_Pos           (28U)
#define RCC_APBENR1_PWREN_Msk           (0x1UL << RCC_APBENR1_PWREN_Pos)       /*!< 0x10000000 */
#define RCC_APBENR1_PWREN               RCC_APBENR1_PWREN_Msk
#define RCC_APBENR1_LPTIMEN_Pos         (31U)
#define RCC_APBENR1_LPTIMEN_Msk         (0x1UL << RCC_APBENR1_LPTIMEN_Pos)     /*!< 0x80000000 */
#define RCC_APBENR1_LPTIMEN             RCC_APBENR1_LPTIMEN_Msk

/********************  Bit definition for RCC_APBENR2 register  **************/
#define RCC_APBENR2_SYSCFGEN_Pos        (0U)
#define RCC_APBENR2_SYSCFGEN_Msk        (0x1UL << RCC_APBENR2_SYSCFGEN_Pos)    /*!< 0x00000001 */
#define RCC_APBENR2_SYSCFGEN            RCC_APBENR2_SYSCFGEN_Msk
#define RCC_APBENR2_TIM1EN_Pos          (11U)
#define RCC_APBENR2_TIM1EN_Msk          (0x1UL << RCC_APBENR2_TIM1EN_Pos)      /*!< 0x00000800 */
#define RCC_APBENR2_TIM1EN              RCC_APBENR2_TIM1EN_Msk
#define RCC_APBENR2_SPI1EN_Pos          (12U)
#define RCC_APBENR2_SPI1EN_Msk          (0x1UL << RCC_APBENR2_SPI1EN_Pos)      /*!< 0x00001000 */
#define RCC_APBENR2_SPI1EN              RCC_APBENR2_SPI1EN_Msk
#define RCC_APBENR2_USART1EN_Pos        (14U)
#define RCC_APBENR2_USART1EN_Msk        (0x1UL << RCC_APBENR2_USART1EN_Pos)    /*!< 0x00004000 */
#define RCC_APBENR2_USART1EN            RCC_APBENR2_USART1EN_Msk
#define RCC_APBENR2_TIM14EN_Pos         (15U)
#define RCC_APBENR2_TIM14EN_Msk         (0x1UL << RCC_APBENR2_TIM14EN_Pos)     /*!< 0x00008000 */
#define RCC_APBENR2_TIM14EN             RCC_APBENR2_TIM14EN_Msk
#define RCC_APBENR2_ADCEN_Pos           (20U)
#define RCC_APBENR2_ADCEN_Msk           (0x1UL << RCC_APBENR2_ADCEN_Pos)       /*!< 0x00100000 */
#define RCC_APBENR2_ADCEN               RCC_APBENR2_ADCEN_Msk
#define RCC_APBENR2_COMP1EN_Pos         (21U)
#define RCC_APBENR2_COMP1EN_Msk         (0x1UL << RCC_APBENR2_COMP1EN_Pos)     /*!< 0x00200000 */
#define RCC_APBENR2_COMP1EN             RCC_APBENR2_COMP1EN_Msk
#define RCC_APBENR2_COMP2EN_Pos         (22U)
#define RCC_APBENR2_COMP2EN_Msk         (0x1UL << RCC_APBENR2_COMP2EN_Pos)     /*!< 0x00400000 */
#define RCC_APBENR2_COMP2EN             RCC_APBENR2_COMP2EN_Msk

/********************  Bit definition for RCC_CCIPR register  ******************/
#define RCC_CCIPR_COMP1SEL_Pos          (10U)
#define RCC_CCIPR_COMP1SEL_Msk          (0x1UL << RCC_CCIPR_COMP1SEL_Pos)      /*!< 0x00000400 */
#define RCC_CCIPR_COMP1SEL              RCC_CCIPR_COMP1SEL_Msk
#define RCC_CCIPR_COMP2SEL_Pos          (11U)
#define RCC_CCIPR_COMP2SEL_Msk          (0x1UL << RCC_CCIPR_COMP2SEL_Pos)      /*!< 0x00000800 */
#define RCC_CCIPR_COMP2SEL              RCC_CCIPR_COMP2SEL_Msk
#define RCC_CCIPR_LPTIMSEL_Pos          (18U)
#define RCC_CCIPR_LPTIMSEL_Msk          (0x3UL << RCC_CCIPR_LPTIMSEL_Pos)      /*!< 0x000C0000 */
#define RCC_CCIPR_LPTIMSEL              RCC_CCIPR_LPTIMSEL_Msk
#define RCC_CCIPR_LPTIMSEL_0            (0x1UL << RCC_CCIPR_LPTIMSEL_Pos)      /*!< 0x00040000 */
#define RCC_CCIPR_LPTIMSEL_1            (0x2UL << RCC_CCIPR_LPTIMSEL_Pos)      /*!< 0x00080000 */

/********************  Bit definition for RCC_BDCR register  ******************/
#define RCC_BDCR_LSEON_Pos              (0U)
#define RCC_BDCR_LSEON_Msk              (0x1UL << RCC_BDCR_LSEON_Pos)          /*!< 0x00000001 */
#define RCC_BDCR_LSEON                  RCC_BDCR_LSEON_Msk
#define RCC_BDCR_LSERDY_Pos             (1U)
#define RCC_BDCR_LSERDY_Msk             (0x1UL << RCC_BDCR_LSERDY_Pos)         /*!< 0x00000002 */
#define RCC_BDCR_LSERDY                 RCC_BDCR_LSERDY_Msk
#define RCC_BDCR_LSEBYP_Pos             (2U)
#define RCC_BDCR_LSEBYP_Msk             (0x1UL << RCC_BDCR_LSEBYP_Pos)         /*!< 0x00000004 */
#define RCC_BDCR_LSEBYP                 RCC_BDCR_LSEBYP_Msk
#define RCC_BDCR_LSECSSON_Pos           (5U)
#define RCC_BDCR_LSECSSON_Msk           (0x1UL << RCC_BDCR_LSECSSON_Pos)       /*!< 0x00000020 */
#define RCC_BDCR_LSECSSON               RCC_BDCR_LSECSSON_Msk
#define RCC_BDCR_LSECSSD_Pos            (6U)
#define RCC_BDCR_LSECSSD_Msk            (0x1UL << RCC_BDCR_LSECSSD_Pos)        /*!< 0x00000040 */
#define RCC_BDCR_LSECSSD                RCC_BDCR_LSECSSD_Msk
/* #define RCC_BDCR_LSCOEN_Pos             (24U) */
/* #define RCC_BDCR_LSCOEN_Msk             (0x1UL << RCC_BDCR_LSCOEN_Pos) */        /*!< 0x01000000 */
/* #define RCC_BDCR_LSCOEN                 RCC_BDCR_LSCOEN_Msk */
#define RCC_BDCR_LSCOSEL_Pos            (25U)
#define RCC_BDCR_LSCOSEL_Msk            (0x1UL << RCC_BDCR_LSCOSEL_Pos)        /*!< 0x02000000 */
#define RCC_BDCR_LSCOSEL                RCC_BDCR_LSCOSEL_Msk

/********************  Bit definition for RCC_CSR register  *******************/
#define RCC_CSR_LSION_Pos               (0U)
#define RCC_CSR_LSION_Msk               (0x1UL << RCC_CSR_LSION_Pos)           /*!< 0x00000001 */
#define RCC_CSR_LSION                   RCC_CSR_LSION_Msk
#define RCC_CSR_LSIRDY_Pos              (1U)
#define RCC_CSR_LSIRDY_Msk              (0x1UL << RCC_CSR_LSIRDY_Pos)          /*!< 0x00000002 */
#define RCC_CSR_LSIRDY                  RCC_CSR_LSIRDY_Msk
#define RCC_CSR_NRST_FLTDIS_Pos         (8U)
#define RCC_CSR_NRST_FLTDIS_Msk         (0x1UL << RCC_CSR_NRST_FLTDIS_Pos)     /*!< 0x00000100 */
#define RCC_CSR_NRST_FLTDIS             RCC_CSR_NRST_FLTDIS_Msk
#define RCC_CSR_RMVF_Pos                (23U)
#define RCC_CSR_RMVF_Msk                (0x1UL << RCC_CSR_RMVF_Pos)            /*!< 0x00800000 */
#define RCC_CSR_RMVF                    RCC_CSR_RMVF_Msk
#define RCC_CSR_OBLRSTF_Pos             (25U)
#define RCC_CSR_OBLRSTF_Msk             (0x1UL << RCC_CSR_OBLRSTF_Pos)         /*!< 0x02000000 */
#define RCC_CSR_OBLRSTF                 RCC_CSR_OBLRSTF_Msk
#define RCC_CSR_PINRSTF_Pos             (26U)
#define RCC_CSR_PINRSTF_Msk             (0x1UL << RCC_CSR_PINRSTF_Pos)         /*!< 0x04000000 */
#define RCC_CSR_PINRSTF                 RCC_CSR_PINRSTF_Msk
#define RCC_CSR_PWRRSTF_Pos             (27U)
#define RCC_CSR_PWRRSTF_Msk             (0x1UL << RCC_CSR_PWRRSTF_Pos)         /*!< 0x08000000 */
#define RCC_CSR_PWRRSTF                 RCC_CSR_PWRRSTF_Msk
#define RCC_CSR_SFTRSTF_Pos             (28U)
#define RCC_CSR_SFTRSTF_Msk             (0x1UL << RCC_CSR_SFTRSTF_Pos)         /*!< 0x10000000 */
#define RCC_CSR_SFTRSTF                 RCC_CSR_SFTRSTF_Msk
#define RCC_CSR_IWDGRSTF_Pos            (29U)
#define RCC_CSR_IWDGRSTF_Msk            (0x1UL << RCC_CSR_IWDGRSTF_Pos)        /*!< 0x20000000 */
#define RCC_CSR_IWDGRSTF                RCC_CSR_IWDGRSTF_Msk

/********************  Bit definition for RCC_CSR register  *******************/
/* #define RCC_CSR_VREFBUF_TRIM_Pos        (0U) */
/* #define RCC_CSR_VREFBUF_TRIM_Msk        (0x1FUL << RCC_CSR_VREFBUF_TRIM_Pos) */  /*!< 0x0000001F */
/* #define RCC_CSR_VREFBUF_TRIM            RCC_CSR_VREFBUF_TRIM_Msk */

/******************************************************************************/
/*                                                                            */
/*                        Serial Peripheral Interface (SPI)                   */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for SPI_CR1 register  ********************/
#define SPI_CR1_CPHA_Pos                (0U)
#define SPI_CR1_CPHA_Msk                (0x1UL << SPI_CR1_CPHA_Pos)            /*!< 0x00000001 */
#define SPI_CR1_CPHA                    SPI_CR1_CPHA_Msk                       /*!< Clock Phase */
#define SPI_CR1_CPOL_Pos                (1U)
#define SPI_CR1_CPOL_Msk                (0x1UL << SPI_CR1_CPOL_Pos)            /*!< 0x00000002 */
#define SPI_CR1_CPOL                    SPI_CR1_CPOL_Msk                       /*!< Clock Polarity */
#define SPI_CR1_MSTR_Pos                (2U)
#define SPI_CR1_MSTR_Msk                (0x1UL << SPI_CR1_MSTR_Pos)            /*!< 0x00000004 */
#define SPI_CR1_MSTR                    SPI_CR1_MSTR_Msk                       /*!< Master Selection */
#define SPI_CR1_BR_Pos                  (3U)
#define SPI_CR1_BR_Msk                  (0x7UL << SPI_CR1_BR_Pos)              /*!< 0x00000038 */
#define SPI_CR1_BR                      SPI_CR1_BR_Msk                         /*!< BR[2:0] bits (Baud Rate Control) */
#define SPI_CR1_BR_0                    (0x1UL << SPI_CR1_BR_Pos)              /*!< 0x00000008 */
#define SPI_CR1_BR_1                    (0x2UL << SPI_CR1_BR_Pos)              /*!< 0x00000010 */
#define SPI_CR1_BR_2                    (0x4UL << SPI_CR1_BR_Pos)              /*!< 0x00000020 */
#define SPI_CR1_SPE_Pos                 (6U)
#define SPI_CR1_SPE_Msk                 (0x1UL << SPI_CR1_SPE_Pos)             /*!< 0x00000040 */
#define SPI_CR1_SPE                     SPI_CR1_SPE_Msk                        /*!< SPI Enable */
#define SPI_CR1_LSBFIRST_Pos            (7U)
#define SPI_CR1_LSBFIRST_Msk            (0x1UL << SPI_CR1_LSBFIRST_Pos)        /*!< 0x00000080 */
#define SPI_CR1_LSBFIRST                SPI_CR1_LSBFIRST_Msk                   /*!< Frame Format */
#define SPI_CR1_SSI_Pos                 (8U)
#define SPI_CR1_SSI_Msk                 (0x1UL << SPI_CR1_SSI_Pos)             /*!< 0x00000100 */
#define SPI_CR1_SSI                     SPI_CR1_SSI_Msk                        /*!< Internal slave select */
#define SPI_CR1_SSM_Pos                 (9U)
#define SPI_CR1_SSM_Msk                 (0x1UL << SPI_CR1_SSM_Pos)             /*!< 0x00000200 */
#define SPI_CR1_SSM                     SPI_CR1_SSM_Msk                        /*!< Software slave management */
#define SPI_CR1_RXONLY_Pos              (10U)
#define SPI_CR1_RXONLY_Msk              (0x1UL << SPI_CR1_RXONLY_Pos)          /*!< 0x00000400 */
#define SPI_CR1_RXONLY                  SPI_CR1_RXONLY_Msk                     /*!< Receive only */
#define SPI_CR1_DFF_Pos                 (11U)
#define SPI_CR1_DFF_Msk                 (0x1UL << SPI_CR1_DFF_Pos)             /*!< 0x00000800 */
#define SPI_CR1_DFF                     SPI_CR1_DFF_Msk                        /*!< Data frame format */
#define SPI_CR1_BIDIOE_Pos              (14U)
#define SPI_CR1_BIDIOE_Msk              (0x1UL << SPI_CR1_BIDIOE_Pos)          /*!< 0x00004000 */
#define SPI_CR1_BIDIOE                  SPI_CR1_BIDIOE_Msk                     /*!< Output enable in bidirectional mode */
#define SPI_CR1_BIDIMODE_Pos            (15U)
#define SPI_CR1_BIDIMODE_Msk            (0x1UL << SPI_CR1_BIDIMODE_Pos)        /*!< 0x00008000 */
#define SPI_CR1_BIDIMODE                SPI_CR1_BIDIMODE_Msk                   /*!< Bidirectional data mode enable */

