OpenPuya/PY32M010_Firmware/Drivers/CMSIS/Device/PY32Mxxx/Include/py32m010x5.h
/*******************  Bit definition for SPI_CR2 register  ********************/
#define SPI_CR2_SSOE_Pos                (2U)
#define SPI_CR2_SSOE_Msk                (0x1UL << SPI_CR2_SSOE_Pos)             /*!< 0x00000004 */
#define SPI_CR2_SSOE                    SPI_CR2_SSOE_Msk                       /*!< SS Output Enable */
#define SPI_CR2_CLRTXFIFO_Pos           (4U)
#define SPI_CR2_CLRTXFIFO_Msk           (0x1UL << SPI_CR2_CLRTXFIFO_Pos)       /*!< 0x00000010 */
#define SPI_CR2_CLRTXFIFO               SPI_CR2_CLRTXFIFO_Msk
#define SPI_CR2_ERRIE_Pos               (5U)
#define SPI_CR2_ERRIE_Msk               (0x1UL << SPI_CR2_ERRIE_Pos)           /*!< 0x00000020 */
#define SPI_CR2_ERRIE                   SPI_CR2_ERRIE_Msk                      /*!< Error Interrupt Enable */
#define SPI_CR2_RXNEIE_Pos              (6U)
#define SPI_CR2_RXNEIE_Msk              (0x1UL << SPI_CR2_RXNEIE_Pos)          /*!< 0x00000040 */
#define SPI_CR2_RXNEIE                  SPI_CR2_RXNEIE_Msk                     /*!< RX buffer Not Empty Interrupt Enable */
#define SPI_CR2_TXEIE_Pos               (7U)
#define SPI_CR2_TXEIE_Msk               (0x1UL << SPI_CR2_TXEIE_Pos)           /*!< 0x00000080 */
#define SPI_CR2_TXEIE                   SPI_CR2_TXEIE_Msk                      /*!< Tx buffer Empty Interrupt Enable */

/********************  Bit definition for SPI_SR register  ********************/
#define SPI_SR_RXNE_Pos                 (0U)
#define SPI_SR_RXNE_Msk                 (0x1UL << SPI_SR_RXNE_Pos)             /*!< 0x00000001 */
#define SPI_SR_RXNE                     SPI_SR_RXNE_Msk                        /*!< Receive buffer Not Empty */
#define SPI_SR_TXE_Pos                  (1U)
#define SPI_SR_TXE_Msk                  (0x1UL << SPI_SR_TXE_Pos)              /*!< 0x00000002 */
#define SPI_SR_TXE                      SPI_SR_TXE_Msk                         /*!< Transmit buffer Empty */
#define SPI_SR_MODF_Pos                 (5U)
#define SPI_SR_MODF_Msk                 (0x1UL << SPI_SR_MODF_Pos)             /*!< 0x00000020 */
#define SPI_SR_MODF                     SPI_SR_MODF_Msk                        /*!< Mode fault */
#define SPI_SR_OVR_Pos                  (6U)
#define SPI_SR_OVR_Msk                  (0x1UL << SPI_SR_OVR_Pos)              /*!< 0x00000040 */
#define SPI_SR_OVR                      SPI_SR_OVR_Msk                         /*!< Overrun flag */
#define SPI_SR_BSY_Pos                  (7U)
#define SPI_SR_BSY_Msk                  (0x1UL << SPI_SR_BSY_Pos)              /*!< 0x00000080 */
#define SPI_SR_BSY                      SPI_SR_BSY_Msk                         /*!< Busy flag */
#define SPI_SR_FRLVL_Pos                (9U)
#define SPI_SR_FRLVL_Msk                (0x1UL << SPI_SR_FRLVL_Pos)            /*!< 0x00000200 */
#define SPI_SR_FRLVL                    SPI_SR_FRLVL_Msk                       /*!< FIFO Reception Level */
#define SPI_SR_FTLVL_Pos                (11U)
#define SPI_SR_FTLVL_Msk                (0x1UL << SPI_SR_FTLVL_Pos)            /*!< 0x00000800 */
#define SPI_SR_FTLVL                    SPI_SR_FTLVL_Msk                       /*!< FIFO Transmission Level */

/********************  Bit definition for SPI_DR register  ********************/
#define SPI_DR_DR_Pos                   (0U)
#define SPI_DR_DR_Msk                   (0xFFFFUL << SPI_DR_DR_Pos)            /*!< 0x0000FFFF */
#define SPI_DR_DR                       SPI_DR_DR_Msk                          /*!< Data Register */



/******************************************************************************/
/*                                                                            */
/*                       System Configuration (SYSCFG)                        */
/*                                                                            */
/******************************************************************************/
/*****************  Bit definition for SYSCFG_CFGR1 register  ****************/
#define SYSCFG_CFGR1_MEM_MODE_Pos                 (0U)
#define SYSCFG_CFGR1_MEM_MODE_Msk                 (0x3UL << SYSCFG_CFGR1_MEM_MODE_Pos) /*!< 0x00000003 */
#define SYSCFG_CFGR1_MEM_MODE                     SYSCFG_CFGR1_MEM_MODE_Msk            /*!< SYSCFG_Memory Remap Config */
#define SYSCFG_CFGR1_MEM_MODE_0                   (0x1UL << SYSCFG_CFGR1_MEM_MODE_Pos) /*!< 0x00000001 */
#define SYSCFG_CFGR1_MEM_MODE_1                   (0x2UL << SYSCFG_CFGR1_MEM_MODE_Pos) /*!< 0x00000002 */
#define SYSCFG_CFGR1_TIM1_IC1_SRC_Pos             (2U)
#define SYSCFG_CFGR1_TIM1_IC1_SRC_Msk             (0x3UL << SYSCFG_CFGR1_TIM1_IC1_SRC_Pos) /*!< 0x0000000C */
#define SYSCFG_CFGR1_TIM1_IC1_SRC                 SYSCFG_CFGR1_TIM1_IC1_SRC_Msk
#define SYSCFG_CFGR1_TIM1_IC1_SRC_0               (0x1UL << SYSCFG_CFGR1_TIM1_IC1_SRC_Pos) /*!< 0x00000004 */
#define SYSCFG_CFGR1_TIM1_IC1_SRC_1               (0x2UL << SYSCFG_CFGR1_TIM1_IC1_SRC_Pos) /*!< 0x00000008 */
#define SYSCFG_CFGR1_COMP1_OCREF_CLR_TIM1_Pos     (4U)
#define SYSCFG_CFGR1_COMP1_OCREF_CLR_TIM1_Msk     (0x1UL << SYSCFG_CFGR1_COMP1_OCREF_CLR_TIM1_Pos) /*!< 0x00000010 */
#define SYSCFG_CFGR1_COMP1_OCREF_CLR_TIM1         SYSCFG_CFGR1_COMP1_OCREF_CLR_TIM1_Msk            /*!< COMP1 */
#define SYSCFG_CFGR1_COMP2_OCREF_CLR_TIM1_Pos     (5U)
#define SYSCFG_CFGR1_COMP2_OCREF_CLR_TIM1_Msk     (0x1UL << SYSCFG_CFGR1_COMP2_OCREF_CLR_TIM1_Pos) /*!< 0x00000020 */
#define SYSCFG_CFGR1_COMP2_OCREF_CLR_TIM1         SYSCFG_CFGR1_COMP2_OCREF_CLR_TIM1_Msk            /*!< COMP2 */
#define SYSCFG_CFGR1_I2C_PA2_FMP_Pos              (16U)
#define SYSCFG_CFGR1_I2C_PA2_FMP_Msk              (0x1UL << SYSCFG_CFGR1_I2C_PA2_FMP_Pos) /*!< 0x00010000 */
#define SYSCFG_CFGR1_I2C_PA2_FMP                  SYSCFG_CFGR1_I2C_PA2_FMP_Msk            /*!< PA2 FMP */
#define SYSCFG_CFGR1_I2C_PB3_FMP_Pos              (17U)
#define SYSCFG_CFGR1_I2C_PB3_FMP_Msk              (0x1UL << SYSCFG_CFGR1_I2C_PB3_FMP_Pos) /*!< 0x00020000 */
#define SYSCFG_CFGR1_I2C_PB3_FMP                  SYSCFG_CFGR1_I2C_PB3_FMP_Msk            /*!< PB3 FMP */
#define SYSCFG_CFGR1_I2C_PB4_FMP_Pos              (18U)
#define SYSCFG_CFGR1_I2C_PB4_FMP_Msk              (0x1UL << SYSCFG_CFGR1_I2C_PB4_FMP_Pos) /*!< 0x00040000 */
#define SYSCFG_CFGR1_I2C_PB4_FMP                  SYSCFG_CFGR1_I2C_PB4_FMP_Msk            /*!< PB4 FMP */
#define SYSCFG_CFGR1_I2C_PB6_FMP_Pos              (19U)
#define SYSCFG_CFGR1_I2C_PB6_FMP_Msk              (0x1UL << SYSCFG_CFGR1_I2C_PB6_FMP_Pos) /*!< 0x00080000 */
#define SYSCFG_CFGR1_I2C_PB6_FMP                  SYSCFG_CFGR1_I2C_PB6_FMP_Msk            /*!< PB6 FMP */

/******************  Bit definition for SYSCFG_CFGR2 register  ****************/
#define SYSCFG_CFGR2_LOCKUP_LOCK_Pos              (0U)
#define SYSCFG_CFGR2_LOCKUP_LOCK_Msk              (0x1UL << SYSCFG_CFGR2_LOCKUP_LOCK_Pos)    /*!< 0x00000001 */
#define SYSCFG_CFGR2_LOCKUP_LOCK                  SYSCFG_CFGR2_LOCKUP_LOCK_Msk               /*!< Enables and locks the LOCKUP_LOCK (Hardfault) output of CortexM0 with Break Input of TIMER1 */
#define SYSCFG_CFGR2_COMP1_BRK_TIM1_Pos           (3U)
#define SYSCFG_CFGR2_COMP1_BRK_TIM1_Msk           (0x1UL << SYSCFG_CFGR2_COMP1_BRK_TIM1_Pos) /*!< 0x00000008 */
#define SYSCFG_CFGR2_COMP1_BRK_TIM1               SYSCFG_CFGR2_COMP1_BRK_TIM1_Msk            /*!< COMP1_BRK_TIM1 */
#define SYSCFG_CFGR2_COMP2_BRK_TIM1_Pos           (4U)
#define SYSCFG_CFGR2_COMP2_BRK_TIM1_Msk           (0x1UL << SYSCFG_CFGR2_COMP2_BRK_TIM1_Pos) /*!< 0x00000010 */
#define SYSCFG_CFGR2_COMP2_BRK_TIM1               SYSCFG_CFGR2_COMP2_BRK_TIM1_Msk            /*!< COMP2_BRK_TIM1 */
#define SYSCFG_CFGR2_ETR_SRC_TIM1_Pos             (9U)
#define SYSCFG_CFGR2_ETR_SRC_TIM1_Msk             (0x3UL << SYSCFG_CFGR2_ETR_SRC_TIM1_Pos)   /*!< 0x00000600 */
#define SYSCFG_CFGR2_ETR_SRC_TIM1                 SYSCFG_CFGR2_ETR_SRC_TIM1_Msk              /*!< ETR_SRC_TIM1 */
#define SYSCFG_CFGR2_ETR_SRC_TIM1_0               (0x1UL << SYSCFG_CFGR2_ETR_SRC_TIM1_Pos)
#define SYSCFG_CFGR2_ETR_SRC_TIM1_1               (0x2UL << SYSCFG_CFGR2_ETR_SRC_TIM1_Pos)

/*****************  Bit definition for GPIO_ENS register  ************************/
#define SYSCFG_GPIO_ENS_PA_ENS_Pos                (0U)
#define SYSCFG_GPIO_ENS_PA_ENS_Msk                (0xFFUL << SYSCFG_GPIO_ENS_PA_ENS_Pos)     /*!< 0x000000FF */
#define SYSCFG_GPIO_ENS_PA_ENS                    SYSCFG_GPIO_ENS_PA_ENS_Msk                 /*!< PA_ENS[7:0] bits (desc PA_ENS) */
#define SYSCFG_GPIO_ENS_PA0_ENS                   (0x1UL << SYSCFG_GPIO_ENS_PA_ENS_Pos)
#define SYSCFG_GPIO_ENS_PA1_ENS                   (0x2UL << SYSCFG_GPIO_ENS_PA_ENS_Pos)
#define SYSCFG_GPIO_ENS_PA2_ENS                   (0x4UL << SYSCFG_GPIO_ENS_PA_ENS_Pos)
#define SYSCFG_GPIO_ENS_PA3_ENS                   (0x8UL << SYSCFG_GPIO_ENS_PA_ENS_Pos)
#define SYSCFG_GPIO_ENS_PA4_ENS                   (0x10UL << SYSCFG_GPIO_ENS_PA_ENS_Pos)
#define SYSCFG_GPIO_ENS_PA5_ENS                   (0x20UL << SYSCFG_GPIO_ENS_PA_ENS_Pos)
#define SYSCFG_GPIO_ENS_PA6_ENS                   (0x40UL << SYSCFG_GPIO_ENS_PA_ENS_Pos)
#define SYSCFG_GPIO_ENS_PA7_ENS                   (0x80UL << SYSCFG_GPIO_ENS_PA_ENS_Pos)
#define SYSCFG_GPIO_ENS_PB_ENS_Pos                (8U)
#define SYSCFG_GPIO_ENS_PB_ENS_Msk                (0xFFUL << SYSCFG_GPIO_ENS_PB_ENS_Pos)    /*!< 0x0000FF00 */
#define SYSCFG_GPIO_ENS_PB_ENS                    SYSCFG_GPIO_ENS_PB_ENS_Msk                /*!< PB_ENS[15:8] bits (desc PB_ENS) */
#define SYSCFG_GPIO_ENS_PB0_ENS                   (0x1UL << SYSCFG_GPIO_ENS_PB_ENS_Pos)
#define SYSCFG_GPIO_ENS_PB1_ENS                   (0x2UL << SYSCFG_GPIO_ENS_PB_ENS_Pos)
#define SYSCFG_GPIO_ENS_PB2_ENS                   (0x4UL << SYSCFG_GPIO_ENS_PB_ENS_Pos)
#define SYSCFG_GPIO_ENS_PB3_ENS                   (0x8UL << SYSCFG_GPIO_ENS_PB_ENS_Pos)
#define SYSCFG_GPIO_ENS_PB4_ENS                   (0x10UL << SYSCFG_GPIO_ENS_PB_ENS_Pos)
#define SYSCFG_GPIO_ENS_PB5_ENS                   (0x20UL << SYSCFG_GPIO_ENS_PB_ENS_Pos)
#define SYSCFG_GPIO_ENS_PB6_ENS                   (0x40UL << SYSCFG_GPIO_ENS_PB_ENS_Pos)
#define SYSCFG_GPIO_ENS_PB7_ENS                   (0x80UL << SYSCFG_GPIO_ENS_PB_ENS_Pos)
#define SYSCFG_GPIO_ENS_PC_ENS_Pos                (16U)
#define SYSCFG_GPIO_ENS_PC_ENS_Msk                (0x3UL << SYSCFG_GPIO_ENS_PC_ENS_Pos)     /*!< 0x00030000 */
#define SYSCFG_GPIO_ENS_PC_ENS                    SYSCFG_GPIO_ENS_PC_ENS_Msk                /*!< PC_ENS[17:16] bits (desc PC_ENS) */
#define SYSCFG_GPIO_ENS_PC0_ENS                   (0x1UL << SYSCFG_GPIO_ENS_PC_ENS_Pos)
#define SYSCFG_GPIO_ENS_PC1_ENS                   (0x2UL << SYSCFG_GPIO_ENS_PC_ENS_Pos)

/*****************************************************************************/
/*                                                                           */
/*                               Timers (TIM)                                */
/*                                                                           */
/*****************************************************************************/
/*******************  Bit definition for TIM_CR1 register  *******************/
#define TIM_CR1_CEN_Pos           (0U)
#define TIM_CR1_CEN_Msk           (0x1UL << TIM_CR1_CEN_Pos)                    /*!< 0x00000001 */
#define TIM_CR1_CEN               TIM_CR1_CEN_Msk                               /*!<Counter enable */
#define TIM_CR1_UDIS_Pos          (1U)
#define TIM_CR1_UDIS_Msk          (0x1UL << TIM_CR1_UDIS_Pos)                   /*!< 0x00000002 */
#define TIM_CR1_UDIS              TIM_CR1_UDIS_Msk                              /*!<Update disable */
#define TIM_CR1_URS_Pos           (2U)
#define TIM_CR1_URS_Msk           (0x1UL << TIM_CR1_URS_Pos)                    /*!< 0x00000004 */
#define TIM_CR1_URS               TIM_CR1_URS_Msk                               /*!<Update request source */
#define TIM_CR1_OPM_Pos           (3U)
#define TIM_CR1_OPM_Msk           (0x1UL << TIM_CR1_OPM_Pos)                    /*!< 0x00000008 */
#define TIM_CR1_OPM               TIM_CR1_OPM_Msk                               /*!<One pulse mode */
#define TIM_CR1_DIR_Pos           (4U)
#define TIM_CR1_DIR_Msk           (0x1UL << TIM_CR1_DIR_Pos)                    /*!< 0x00000010 */
#define TIM_CR1_DIR               TIM_CR1_DIR_Msk                               /*!<Direction */
#define TIM_CR1_CMS_Pos           (5U)
#define TIM_CR1_CMS_Msk           (0x3UL << TIM_CR1_CMS_Pos)                    /*!< 0x00000060 */
#define TIM_CR1_CMS               TIM_CR1_CMS_Msk                               /*!<CMS[1:0] bits (Center-aligned mode selection) */
#define TIM_CR1_CMS_0             (0x1UL << TIM_CR1_CMS_Pos)                    /*!< 0x00000020 */
#define TIM_CR1_CMS_1             (0x2UL << TIM_CR1_CMS_Pos)                    /*!< 0x00000040 */
#define TIM_CR1_ARPE_Pos          (7U)
#define TIM_CR1_ARPE_Msk          (0x1UL << TIM_CR1_ARPE_Pos)                   /*!< 0x00000080 */
#define TIM_CR1_ARPE              TIM_CR1_ARPE_Msk                              /*!<Auto-reload preload enable */
#define TIM_CR1_CKD_Pos           (8U)
#define TIM_CR1_CKD_Msk           (0x3UL << TIM_CR1_CKD_Pos)                    /*!< 0x00000300 */
#define TIM_CR1_CKD               TIM_CR1_CKD_Msk                               /*!<CKD[1:0] bits (clock division) */
#define TIM_CR1_CKD_0             (0x1UL << TIM_CR1_CKD_Pos)                    /*!< 0x00000100 */
#define TIM_CR1_CKD_1             (0x2UL << TIM_CR1_CKD_Pos)                    /*!< 0x00000200 */

/*******************  Bit definition for TIM_CR2 register  *******************/
#define TIM_CR2_CCPC_Pos          (0U)
#define TIM_CR2_CCPC_Msk          (0x1UL << TIM_CR2_CCPC_Pos)                   /*!< 0x00000001 */
#define TIM_CR2_CCPC              TIM_CR2_CCPC_Msk                              /*!<Capture/Compare Preloaded Control */
#define TIM_CR2_CCUS_Pos          (2U)
#define TIM_CR2_CCUS_Msk          (0x1UL << TIM_CR2_CCUS_Pos)                   /*!< 0x00000004 */
#define TIM_CR2_CCUS              TIM_CR2_CCUS_Msk                              /*!<Capture/Compare Control Update Selection */
#define TIM_CR2_MMS_Pos           (4U)
#define TIM_CR2_MMS_Msk           (0x7UL << TIM_CR2_MMS_Pos)                    /*!< 0x00000070 */
#define TIM_CR2_MMS               TIM_CR2_MMS_Msk                               /*!<MMS[2:0] bits (Master Mode Selection) */
#define TIM_CR2_MMS_0             (0x1UL << TIM_CR2_MMS_Pos)                    /*!< 0x00000010 */
#define TIM_CR2_MMS_1             (0x2UL << TIM_CR2_MMS_Pos)                    /*!< 0x00000020 */
#define TIM_CR2_MMS_2             (0x4UL << TIM_CR2_MMS_Pos)                    /*!< 0x00000040 */
#define TIM_CR2_TI1S_Pos          (7U)
#define TIM_CR2_TI1S_Msk          (0x1UL << TIM_CR2_TI1S_Pos)                   /*!< 0x00000080 */
#define TIM_CR2_TI1S              TIM_CR2_TI1S_Msk                              /*!<TI1 Selection */
#define TIM_CR2_OIS1_Pos          (8U)
#define TIM_CR2_OIS1_Msk          (0x1UL << TIM_CR2_OIS1_Pos)                   /*!< 0x00000100 */
#define TIM_CR2_OIS1              TIM_CR2_OIS1_Msk                              /*!<Output Idle state 1 (OC1 output) */
#define TIM_CR2_OIS1N_Pos         (9U)
#define TIM_CR2_OIS1N_Msk         (0x1UL << TIM_CR2_OIS1N_Pos)                  /*!< 0x00000200 */
#define TIM_CR2_OIS1N             TIM_CR2_OIS1N_Msk                             /*!<Output Idle state 1 (OC1N output) */
#define TIM_CR2_OIS2_Pos          (10U)
#define TIM_CR2_OIS2_Msk          (0x1UL << TIM_CR2_OIS2_Pos)                   /*!< 0x00000400 */
#define TIM_CR2_OIS2              TIM_CR2_OIS2_Msk                              /*!<Output Idle state 2 (OC2 output) */
#define TIM_CR2_OIS2N_Pos         (11U)
#define TIM_CR2_OIS2N_Msk         (0x1UL << TIM_CR2_OIS2N_Pos)                  /*!< 0x00000800 */
#define TIM_CR2_OIS2N             TIM_CR2_OIS2N_Msk                             /*!<Output Idle state 2 (OC2N output) */
#define TIM_CR2_OIS3_Pos          (12U)
#define TIM_CR2_OIS3_Msk          (0x1UL << TIM_CR2_OIS3_Pos)                   /*!< 0x00001000 */
#define TIM_CR2_OIS3              TIM_CR2_OIS3_Msk                              /*!<Output Idle state 3 (OC3 output) */
#define TIM_CR2_OIS3N_Pos         (13U)
#define TIM_CR2_OIS3N_Msk         (0x1UL << TIM_CR2_OIS3N_Pos)                  /*!< 0x00002000 */
#define TIM_CR2_OIS3N             TIM_CR2_OIS3N_Msk                             /*!<Output Idle state 3 (OC3N output) */
#define TIM_CR2_OIS4_Pos          (14U)
#define TIM_CR2_OIS4_Msk          (0x1UL << TIM_CR2_OIS4_Pos)                   /*!< 0x00004000 */
#define TIM_CR2_OIS4              TIM_CR2_OIS4_Msk                              /*!<Output Idle state 4 (OC4 output) */

/*******************  Bit definition for TIM_SMCR register  ******************/
#define TIM_SMCR_SMS_Pos          (0U)
#define TIM_SMCR_SMS_Msk          (0x7UL << TIM_SMCR_SMS_Pos)                   /*!< 0x00000007 */
#define TIM_SMCR_SMS              TIM_SMCR_SMS_Msk                              /*!<SMS[2:0] bits (Slave mode selection) */
#define TIM_SMCR_SMS_0            (0x1UL << TIM_SMCR_SMS_Pos)                   /*!< 0x00000001 */
#define TIM_SMCR_SMS_1            (0x2UL << TIM_SMCR_SMS_Pos)                   /*!< 0x00000002 */
#define TIM_SMCR_SMS_2            (0x4UL << TIM_SMCR_SMS_Pos)                   /*!< 0x00000004 */
#define TIM_SMCR_OCCS_Pos         (3U)
#define TIM_SMCR_OCCS_Msk         (0x1UL << TIM_SMCR_OCCS_Pos)                  /*!< 0x00000008 */
#define TIM_SMCR_OCCS             TIM_SMCR_OCCS_Msk                             /*!< OCREF clear selection */
#define TIM_SMCR_TS_Pos           (4U)
#define TIM_SMCR_TS_Msk           (0x7UL << TIM_SMCR_TS_Pos)                    /*!< 0x00000070 */
#define TIM_SMCR_TS               TIM_SMCR_TS_Msk                               /*!<TS[2:0] bits (Trigger selection) */
#define TIM_SMCR_TS_0             (0x1UL << TIM_SMCR_TS_Pos)                    /*!< 0x00000010 */
#define TIM_SMCR_TS_1             (0x2UL << TIM_SMCR_TS_Pos)                    /*!< 0x00000020 */
#define TIM_SMCR_TS_2             (0x4UL << TIM_SMCR_TS_Pos)                    /*!< 0x00000040 */
#define TIM_SMCR_MSM_Pos          (7U)
#define TIM_SMCR_MSM_Msk          (0x1UL << TIM_SMCR_MSM_Pos)                   /*!< 0x00000080 */
#define TIM_SMCR_MSM              TIM_SMCR_MSM_Msk                              /*!<Master/slave mode */
#define TIM_SMCR_ETF_Pos          (8U)
#define TIM_SMCR_ETF_Msk          (0xFUL << TIM_SMCR_ETF_Pos)                   /*!< 0x00000F00 */
#define TIM_SMCR_ETF              TIM_SMCR_ETF_Msk                              /*!<ETF[3:0] bits (External trigger filter) */
#define TIM_SMCR_ETF_0            (0x1UL << TIM_SMCR_ETF_Pos)                   /*!< 0x00000100 */
#define TIM_SMCR_ETF_1            (0x2UL << TIM_SMCR_ETF_Pos)                   /*!< 0x00000200 */
#define TIM_SMCR_ETF_2            (0x4UL << TIM_SMCR_ETF_Pos)                   /*!< 0x00000400 */
#define TIM_SMCR_ETF_3            (0x8UL << TIM_SMCR_ETF_Pos)                   /*!< 0x00000800 */
#define TIM_SMCR_ETPS_Pos         (12U)
#define TIM_SMCR_ETPS_Msk         (0x3UL << TIM_SMCR_ETPS_Pos)                  /*!< 0x00003000 */
#define TIM_SMCR_ETPS             TIM_SMCR_ETPS_Msk                             /*!<ETPS[1:0] bits (External trigger prescaler) */
#define TIM_SMCR_ETPS_0           (0x1UL << TIM_SMCR_ETPS_Pos)                  /*!< 0x00001000 */
#define TIM_SMCR_ETPS_1           (0x2UL << TIM_SMCR_ETPS_Pos)                  /*!< 0x00002000 */
#define TIM_SMCR_ECE_Pos          (14U)
#define TIM_SMCR_ECE_Msk          (0x1UL << TIM_SMCR_ECE_Pos)                   /*!< 0x00004000 */
#define TIM_SMCR_ECE              TIM_SMCR_ECE_Msk                              /*!<External clock enable */
#define TIM_SMCR_ETP_Pos          (15U)
#define TIM_SMCR_ETP_Msk          (0x1UL << TIM_SMCR_ETP_Pos)                   /*!< 0x00008000 */
#define TIM_SMCR_ETP              TIM_SMCR_ETP_Msk                              /*!<External trigger polarity */

/*******************  Bit definition for TIM_DIER register  ******************/
#define TIM_DIER_UIE_Pos          (0U)
#define TIM_DIER_UIE_Msk          (0x1UL << TIM_DIER_UIE_Pos)                   /*!< 0x00000001 */
#define TIM_DIER_UIE              TIM_DIER_UIE_Msk                              /*!<Update interrupt enable */
#define TIM_DIER_CC1IE_Pos        (1U)
#define TIM_DIER_CC1IE_Msk        (0x1UL << TIM_DIER_CC1IE_Pos)                 /*!< 0x00000002 */
#define TIM_DIER_CC1IE            TIM_DIER_CC1IE_Msk                            /*!<Capture/Compare 1 interrupt enable */
#define TIM_DIER_CC2IE_Pos        (2U)
#define TIM_DIER_CC2IE_Msk        (0x1UL << TIM_DIER_CC2IE_Pos)                 /*!< 0x00000004 */
#define TIM_DIER_CC2IE            TIM_DIER_CC2IE_Msk                            /*!<Capture/Compare 2 interrupt enable */
#define TIM_DIER_CC3IE_Pos        (3U)
#define TIM_DIER_CC3IE_Msk        (0x1UL << TIM_DIER_CC3IE_Pos)                 /*!< 0x00000008 */
#define TIM_DIER_CC3IE            TIM_DIER_CC3IE_Msk                            /*!<Capture/Compare 3 interrupt enable */
#define TIM_DIER_CC4IE_Pos        (4U)
#define TIM_DIER_CC4IE_Msk        (0x1UL << TIM_DIER_CC4IE_Pos)                 /*!< 0x00000010 */
#define TIM_DIER_CC4IE            TIM_DIER_CC4IE_Msk                            /*!<Capture/Compare 4 interrupt enable */
#define TIM_DIER_COMIE_Pos        (5U)
#define TIM_DIER_COMIE_Msk        (0x1UL << TIM_DIER_COMIE_Pos)                 /*!< 0x00000020 */
#define TIM_DIER_COMIE            TIM_DIER_COMIE_Msk                            /*!<COM interrupt enable */
#define TIM_DIER_TIE_Pos          (6U)
#define TIM_DIER_TIE_Msk          (0x1UL << TIM_DIER_TIE_Pos)                   /*!< 0x00000040 */
#define TIM_DIER_TIE              TIM_DIER_TIE_Msk                              /*!<Trigger interrupt enable */
#define TIM_DIER_BIE_Pos          (7U)
#define TIM_DIER_BIE_Msk          (0x1UL << TIM_DIER_BIE_Pos)                   /*!< 0x00000080 */
#define TIM_DIER_BIE              TIM_DIER_BIE_Msk                              /*!<Break interrupt enable */

